zephyrproject-rtos/zephyr/drivers/usb/common/stm32/phy_usbphyc_n6.c
/*
 * Copyright (c) 2025 STMicroelectronics
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/* STM32N6 USBPHYC driver */
#define DT_DRV_COMPAT st_stm32n6_usbphyc /* Unused; defined for grep-ability */

#include <soc.h>

#include <stm32_bitops.h>

#include <zephyr/device.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/sys/util.h>
#include <zephyr/toolchain.h>

#include "stm32_usb_common.h"

#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(usbphyc_n6, CONFIG_STM32_USB_COMMON_LOG_LEVEL);

/* Define our own friendly names since the LL does not provide any */
#define USBPHYC_CR_FSEL_19_2_MHZ	(0u)
#define USBPHYC_CR_FSEL_20_MHZ		(USB_USBPHYC_CR_FSEL_0)
#define USBPHYC_CR_FSEL_24_MHZ		(USB_USBPHYC_CR_FSEL_1)

struct stm32n6_usbphyc_config {
	USB_HS_PHYC_GlobalTypeDef *reg;
	uint32_t num_clocks;
	struct stm32_pclken clocks[];
};

static const struct device *rcc = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);

/*
 * NOTE: the USBPHYC MMIO interface is clock gated by
 * the same bit as the OTG_HS instance itself; this
 * function MUST be called after clock_control_on()
 * in the main USB driver or the SoC will deadlock.
 */
static int stm32n6_usbphyc_enable(const struct stm32_usb_phy *phy)
{
	const struct stm32n6_usbphyc_config *cfg = phy->pcfg;
	clock_control_subsys_t phy_ck;
	uint32_t phy_ck_freq, fsel;
	int res;

	/* Configure PHY input frequency selection */
	if (cfg->num_clocks > 1) {
		phy_ck = (clock_control_subsys_t)&cfg->clocks[1];
	} else {
		phy_ck = (clock_control_subsys_t)&cfg->clocks[0];
	}

	res = clock_control_get_rate(rcc, phy_ck, &phy_ck_freq);
	if (res != 0) {
		LOG_ERR("Failed to get PHY clock rate: %d", res);
		return res;
	}

	switch (phy_ck_freq) {
	case KHZ(19200):
		fsel = USBPHYC_CR_FSEL_19_2_MHZ;
		break;
	case MHZ(20):
		fsel = USBPHYC_CR_FSEL_20_MHZ;
		break;
	case MHZ(24):
		fsel = USBPHYC_CR_FSEL_24_MHZ;
		break;
	default:
		LOG_ERR("Unsupported PHY clock rate: %u Hz", phy_ck_freq);
		return -EINVAL;
	}

	LOG_DBG("PHY clock rate: %u Hz -> FSEL=0x%x", phy_ck_freq, fsel);
	stm32_reg_modify_bits(&cfg->reg->USBPHYC_CR, USB_USBPHYC_CR_FSEL_Msk, fsel);

	/* Configure PHY input mux (if provided) */
	if (cfg->num_clocks > 1) {
		res = clock_control_configure(rcc, (clock_control_subsys_t)&cfg->clocks[1], NULL);
		if (res != 0) {
			LOG_ERR("Failed to configure PHY clock mux: %d", res);
			return res;
		}
	}

	/* Turn on the PHY's clock */
	res = clock_control_on(rcc, (clock_control_subsys_t)&cfg->clocks[0]);
	if (res != 0) {
		LOG_ERR("Failed to enable PHY clock: %d", res);
		return res;
	}

	return 0;
}

static int stm32n6_usbphyc_disable(const struct stm32_usb_phy *phy)
{
	const struct stm32n6_usbphyc_config *cfg = phy->pcfg;

	return clock_control_off(rcc, (clock_control_subsys_t)&cfg->clocks[0]);
}

#define DEFINE_USBPHYC_N6(usb_node, phy_node)							\
	static const struct stm32n6_usbphyc_config CONCAT(phy, DT_DEP_ORD(phy_node), _cfg) = {	\
		.reg = (void *)DT_REG_ADDR(phy_node),						\
		.num_clocks = DT_NUM_CLOCKS(phy_node),						\
		.clocks = STM32_DT_CLOCKS(phy_node)						\
	};											\
	const struct stm32_usb_phy USB_STM32_PHY_PSEUDODEV_NAME(usb_node) = {			\
		.enable = stm32n6_usbphyc_enable,						\
		.disable = stm32n6_usbphyc_disable,						\
		.pcfg = &CONCAT(phy, DT_DEP_ORD(phy_node), _cfg),				\
	};

/*
 * Iterate all USB nodes and instantiate PHY when appropriate.
 * We could implement a stricter check but this should suffice
 * since this pseudo-driver is only compiled for STM32N6 series.
 */
#define _FOREACH_NODE(usb_node)									\
	IF_ENABLED(USB_STM32_NODE_PHY_IS_EMBEDDED_HS(usb_node),					\
		(DEFINE_USBPHYC_N6(usb_node, USB_STM32_PHY(usb_node))))
#define _FOREACH_COMPAT(compat) DT_FOREACH_STATUS_OKAY(compat, _FOREACH_NODE)
FOR_EACH(_FOREACH_COMPAT, (), STM32_USB_COMPATIBLES)
